{
  "work-experience": [
    {
      "dates": {
        "start": "10/2023",
        "end": "Atualmente"
      },
      "role": "Desenvolvedor Web",
      "company": "UX Software",
      "activities": [
        "Liderei e atuei no desenvolvimento de uma plataforma de atendimento para serviços de suporte em ativos de rede de fibra óptica;",
        "Utilizei tecnologias como Node Js, React Js, Next JS e typescript para poder construir a aplicação de forma componentizada e organizada, prezando pela entrega e qualidade",
        "Utilizando o GIT para o versionamento, assim como seus processos de git flow;",
        "Auxiliei na definição da arquitetura de pastas em projetos desenvolvidos em Next.js e React.js, assim como garantir uma organização lógica e eficiente do código",
        "Garanti que fosse possível a integração de forma eficientemente de tecnologias como React.js, Next.js e React Query, adaptando a mudanças rápidas nos requisitos, garantindo assim a entrega."
      ],
      "tags": [
        "Node Js",
        "React Js",
        "GIT",
        "Tailwind",
        "socket-io",
        "Typescript",
        "Next JS",
        "React-query"
      ]
    },
    {
      "dates": {
        "start": "02/2023",
        "end": "06/2023"
      },
      "role": "Desenvolvedor front-end",
      "company": "UX Software",
      "activities": [
        "Utilizei as tecnologias do Next JS, React Js e Typescript para estilização foi usado o styled-components sendo auxiliado pela biblioteca Material UI;",
        "Trabalhei no desenvolvimento de uma plataforma para gerenciamento de projetos de engenharia elétrica",
        "Como principal responsável pela construção do front-end cooperei na organização, distribuição e acompanhamento das tarefas da equipe",
        "Consumi dados a partir de uma Rest API e todo o design do sistema foi feito a partir do figma",
        "Utilizei o GIT para controlar e facilitar a colaboração e docker para a integração com o backend."
      ],
      "tags": [
        "HTML 5",
        "CSS 3",
        "React Js",
        "GIT",
        "Styled Components",
        "Typescript",
        "Next JS"
      ]
    },
    {
      "dates": {
        "start": "05/2022",
        "end": "02/2023"
      },
      "role": "Estagiário front-end",
      "company": "Kernel System Informática e Sistema",
      "activities": [
        "Trabalho extensivo com React JS e Next Js durante o estágio.",
        "Entrega de sistemas com diversos focos, incluindo gerenciamento de campanhas, atendimentos e Landing Pages.",
        "Priorização da aplicação de conhecimentos existentes e novas tecnologias para aprimorar a experiência do usuário.",
        "Implementação de testes unitários para garantir qualidade do software.",
        "Utilização do Git para controle de versionamento, integrado ao Bitbucket."
      ],
      "tags": [
        "Next JS",
        "UI",
        "HTML 5",
        "CSS 3",
        "GIT",
        "React Js"
      ]
    },
    {
      "dates": {
        "start": "08/2021",
        "end": "02/2023"
      },
      "role": "Bolsista front-end",
      "company": "FUNCAP",
      "activities": [
        "Trabalho em um sistema focado no auxílio ao aprendizado de jovens e adultos.",
        "Utilização da linguagem Vue Js para o desenvolvimento.",
        "Correção de bugs, adição de novas funcionalidades e depuração de código.",
        "Atualização do sistema do Vue 2 para o Vue 3 para melhorar segurança e qualidade.",
        "Uso de tecnologias como Vue, vue-bootstrap e GIT para controle de versionamento."
      ],
      "tags": [
        "Vue 2",
        "Vue 3",
        "Vue-bootstrap",
        "Vuex"
      ]
    },
    {
      "dates": {
        "start": "09/2021",
        "end": "02/2022"
      },
      "role": "Desenvolvedor Freelancer Front-end",
      "company": "Freelancer",
      "activities": [
        "Atuei na criação de um sistema para gerenciamento de licitações de uma cidade.",
        "Utilização da linguagem React Js e Material UI para o desenvolvimento.",
        "Criação do protótipo do sistema utilizando o Figma.",
        "Foi usado o GIT para controle de versionamento."
      ],
      "tags": [
        "React js",
        "Figma",
        "Git",
        "Javascript"
      ]
    },
    {
      "dates": {
        "start": "12/2019",
        "end": "08/2021"
      },
      "role": "Desenvolvedor Front-end",
      "company": "Lodaing Desenvolvimento Jr.",
      "activities": [
        "Atuei na criação de site intitucional para empresa local em Sobral e criação de ferramenta interna;",
        "Utilização da linguagem React Js e Styled-Components para o desenvolvimento de uma plataforma de gamificação;",
        "Utilização de Bootstrap e JQuery a fim de acelerar a contrução do sistema;",
        "Foi usado o GIT para controle de versionamento."
      ],
      "tags": [
        "Bootstrap",
        "React js",
        "JQuery",
        "Git",
        "Javascript"
      ]
    }
  ],
  "courses": [
    {
      "company": "Origamid",
      "duration": "16h",
      "title": "UI/UX design para iniciantes",
      "description": "Aprendendo a construir belos designs e conhecendo os principais conceitos do UI."
    }
  ]
}